{
    "projetos": "Projects",
    "sobrenos": "About Us",
    "projeto_Projeto-1_titulo": "Architecture and Urbanism",
    "projeto_Projeto-1_subtitulo": "Modern House",
    "projeto_Projeto-1_descricao": "This project is about an innovation in the world of architecture",
    "projeto_Projeto-2_titulo": "Robotics",
    "projeto_Projeto-2_subtitulo": "Robot Prototype",
    "projeto_Projeto-2_descricao": "This was a project developed for a robot battle",
    "projeto_Projeto-3_titulo": "Economics",
    "projeto_Projeto-3_subtitulo": "Cost Spreadsheet",
    "projeto_Projeto-3_descricao": "Project done in partnership with JM Finances, creating a financial dashboard",
    "projeto_Projeto-4_titulo": "Programming",
    "projeto_Projeto-4_subtitulo": "Rogue",
    "projeto_Projeto-4_descricao": "Game made in Python with the Structured Programming professor",
    "banner_sobre-nos_titulo": "About Us",
    "banner_sobre-nos_subtitulo": "Meet the people responsible for making this project a reality",
    "banner_banner_titulo": "Projects",
    "banner_banner_subtitulo": "Learn about projects done by IBMEC students and teachers",
    "banner_Projeto-1_titulo": "Modern House",
    "banner_Projeto-1_subtitulo": "This project is about innovation in the architecture world",
    "banner_Projeto-2_titulo": "Robot Prototype",
    "banner_Projeto-2_subtitulo": "This is a project that João will give me, but he doesn’t know how to ask",
    "banner_Projeto-3_titulo": "Cost Spreadsheet",
    "banner_Projeto-3_subtitulo": "Project done in partnership with JM Finances, creating a financial dashboard",
    "banner_Projeto-4_titulo": "Rogue",
    "banner_Projeto-4_subtitulo": "Gabriel Corrêa, João Gabriel Miguel, Estevão Batista, Enzo Lazzarotto",
    "detalhamento_Projeto-4_descricao": "Rogue is a strategy and combat game where the player explores a map, facing enemies and leveling up. Each victory allows the purchase of items that improve characteristics such as strength and defense. The game offers an immersive experience with constant challenges and character customization.",
    "detalhamento_Projeto-4_tecnologias": "Game made in Python",
    "detalhamento_Projeto-4_papeis": "Gabriel Corrêa: Game Designer. Responsible for creating the game mechanics.\n João Gabriel: Graphic Artist. Created the game's art.\n Estevão Moraes: Programmer. Implemented the game's logic.\n Enzo Lazzarotto: Responsible for narrative and script. Developed the story.",
    "detalhamento_Projeto-4_texto": "Here is a feature we developed in Rogue: the NPC shop. This feature gave us quite a bit of trouble, as we were stuck for a long time trying to figure out the best way to create a new screen. It was a process of trial and error, where we explored different approaches, but nothing seemed to work the way we wanted. We spent several hours discussing alternatives and analyzing how to implement the feature without breaking the game's flow. Initially, we considered more complex solutions that would involve significant changes to the code structure and the logic of how screens were rendered. We even considered rewriting parts of the screen navigation system. However, after much time reflecting and brainstorming, we realized that the solution was actually much simpler than we had imagined. All we needed to do was assign the screen variable we had previously defined the value of the Shop() function we had created. This small change solved the problem, allowing the new NPC shop screen to be displayed correctly. It was one of those 'eureka' moments where something that seemed complicated turned out to be, in fact, quite straightforward.",
    
    "detalhamento_Projeto-1_descricao": "This modern residential project stands out for its use of straight lines, geometric volumes, and large glass areas that ensure natural lighting...",
    "detalhamento_Projeto-1_tecnologias": "Project made with Notion, Excel, AutoCAD",
    "detalhamento_Projeto-1_papeis": "Carlos Ferreira: Lead Architect.\n Ana Souza: Interior Designer.\n João Mendes: Structural Engineer.\n Larissa Duarte: Landscaper.",
    "detalhamento_Projeto-1_texto": "This is the layout of a modern and functional residence, designed to optimize space usage without sacrificing comfort and aesthetics. The social area includes a kitchen integrated with the dining room, covering 13.6 m², creating a practical space ideal for interaction during meals and family moments. Next to it, the 11 m² living room connects to a 5.3 m² balcony, bringing ventilation and natural light to the environment and creating a relaxing and versatile area for residents. In the private area, the project has two well-sized bedrooms: one with 8.2 m², ideal for a single room, and another with 9.9 m², offering more space for a couple. The 3.7 m² social bathroom serves these two bedrooms and is conveniently located for easy access. Complementing the layout, the 2.7 m² laundry room is positioned to facilitate household activities without interfering with privacy and the flow of the house. The 2.7 m² circulation area connects the spaces smoothly, ensuring practicality and efficient space usage. This project reflects contemporary architecture that balances functionality and aesthetics, providing a comfortable and well-organized home to meet daily needs with style.",
    "imagem_do_projeto": "Project Image",
    "descricao": "Description",
    "tecnologias_usadas": "Technologies Used",
    "papeis_dos_integrantes": "Roles of Team Members",
    "data_de_inicio_e_fim": "Start and End Date",
    "buscar": "Search",
    "unidade": "Unit",
    "curso": "Course",
    "tecnologias": "Technologies",
    "periodo": "Period",
    "todos": "All",
    "aplicar_filtro": "Apply Filter",
    "desfazer_filtros": "Clear Filters",
    "arquitetura": "Architecture",
    "ciencia_de_dados": "Data Science & A.I",
    "direito": "Law",
    "economia": "Economics",
    "engenharia_civil": "Civil Engineering",
    "engenharia_da_computacao": "Computer Engineering",
    "C++": "C++",
    "excel": "Excel",
    "notion": "Notion",
    "power_bi": "Power BI",
    "python": "Python",
    "react": "React",
    "trello": "Trello",
    "Curso": "Course",
    "Idade": "Age",
    "quem_somos_sobre_nos": "Who We Are?",
    "texto_sobre_nos": "We are the Front Pioneers, a group of IBMEC students dedicated to sharing the projects carried out by our peers and professors. Our system was created to showcase these projects in an accessible way, highlighting the participants and their theses. We aim to facilitate access to the ideas and research developed, promoting knowledge exchange within our institution and beyond.",
    "acessar_projeto": "View Project"
  
}