[
    { 
        "id": "Projeto-4",
        "url": "imagens/rogue.png",
        "descricao": "Rogue é um jogo de estratégia e combate onde o jogador explora um mapa, enfrentando inimigos e subindo de nível. Cada vitória permite a compra de itens que melhoram características como força e defesa. O jogo oferece uma experiência envolvente com desafios constantes e personalização de personagens.",
        "tecnologias": "Jogo feito em Python",
        "papeis": " Gabriel Corrêa: Designer do jogo. Responsável por criar a mecânica do jogo.\n João Gabriel: Artista Gráfico. Criou a arte do jogo.\n Estevão Moraes: Programador. Implementou a lógica do jogo.\n Enzo Lazzarotto: Responsável pela narrativa e roteiro. Desenvolveu a história. ",
        "data": "Início: Abril de 2024 / Fim: Junho de 2024",
        "url_2": "imagens/Loja_Rogue.png",
        "texto": "Aqui está uma funcionalidade que desenvolvemos no Rogue: a loja do NPC. Esse recurso nos deu bastante trabalho, pois ficamos travados durante um bom tempo tentando descobrir a melhor forma de criar uma nova tela. Foi um processo de muita tentativa e erro, onde exploramos diferentes abordagens, mas parecia que nada funcionava do jeito que queríamos. Passamos várias horas discutindo alternativas e analisando como implementar a funcionalidade sem quebrar o fluxo do jogo. Inicialmente, pensamos em soluções mais complexas, que envolveriam mudanças significativas na estrutura do código e na lógica de como as telas eram renderizadas. Estávamos até cogitando reescrever partes do sistema de navegação entre as telas do jogo. No entanto, após muito tempo de reflexão e brainstorming, percebemos que a solução era, na verdade, muito mais simples do que imaginávamos. Tudo o que precisávamos fazer era atribuir à variável tela que havíamos previamente definido o valor da função Loja( ) que havíamos criado. Essa pequena mudança resolveu o problema, permitindo que a nova tela da loja do NPC fosse exibida corretamente. Foi um daqueles momentos de 'eureka', onde algo que parecia complicado se mostrou, na realidade, bem direto."
    }

]